// Завдання 1:
// Задано масив з числовими значеннями 2,-5,-9,2,-4,5,34,-11,2,3-,4,5,-6,9;
// В масиві визначити суму від’ємних елементів
var array1 = [2,-5,-9,-2,-4,5,3,4,-11,2,3,-4,5,-6,9]
let summ = 0
for (i = 0;i < 15;i++){
    if (array1[i] < 0){
        summ += array1[i]
    }
}
document.write('<p> // Завдання 1:Задано масив з числовими значеннями 2,-5,-9,2,-4,5,34,-11,2,3-,4,5,-6,9;В масиві визначити суму від’ємних елементів</p>')


document.write(`Дано масив чисел: [${array1.join(' ')}] <br> Cума всіх від'ємних елементів масиву = ${summ} <br>`)

// Завдання 2:
// Задано масив з числовими значеннями 45,65,48,52,45,-78,-96,25,14,25,45;
// В одновимірному масиві визначити номер максимального елемента масива.

var array2 = [45,65,48,52,45,-78,-96,25,14,25,45]
var maxIndex = array2.indexOf( Math.max.apply(null, array2));
document.write('<p>// Завдання 2:Задано масив з числовими значеннями 45,65,48,52,45,-78,-96,25,14,25,45;В одновимірному масиві визначити номер максимального елемента масива.</p>')
document.write(`<br>Дано масив чисел: [${array2.join(' ')}] <br> Максимальний елемент масиву = ${maxIndex}`)

// Завдання 3:
// Задано масив А, що містить 100 цілих чисел. Знайти суму елементів цього масиву.

var a = []
let res = 0
for (let i = 0; i < 100;i++){
    a.push(Math.ceil(Math.random()*20))
    res += a[i]
}
document.write('<p>// Завдання 3:Задано масив А, що містить 100 цілих чисел. Знайти суму елементів цього масиву.</p>')
document.write(`<br><br>Дано масив чисел: [${a.join(' ')}] <br> Сума всіх елементів  = ${res}`)
document.write('<p>// Завдання 4:Задано масив В, що містить 50 цілих чисел. Знайти добуток елементів масиву, що є непарними числами.</p>')
var b = []
let dobytok = 1
for (let i = 0;i < 50; i++){
    b.push(Math.ceil(Math.random()*10))
    if ((b[i]%2) > 0){
        dobytok = dobytok * b[i]
    }

}
document.write(`<br><br>Дано масив чисел: [${b.join(' ')}] <br> Добуток непарних елементів масиву  = ${dobytok}`)
